<!-- Terragrunt Plan -->
## 📋 Terragrunt PLAN summary

**Step URL:** https://github.com/proxmox-home-lab/.github/actions/runs/23312608655/job/67803614610#step:6:1

**Changed Stacks:**
- `github` (`iac/prod/github`)

| Stack | Stack Path | Unit | Result | Summary |
|---|---|---|---:|---|
| `github` | `iac/prod/github` | `repo-github-actions` | ✏️ | Plan: 1 to add, 1 to change, 0 to destroy. |
| `github` | `iac/prod/github` | `repo-github-org` | ✏️ | Plan: 0 to add, 1 to change, 0 to destroy. |
| `github` | `iac/prod/github` | `repo-infrastructure-catalog` | ✏️ | Plan: 1 to add, 1 to change, 0 to destroy. |
| `github` | `iac/prod/github` | `repo-infrastructure-core` | ✏️ | Plan: 1 to add, 1 to change, 0 to destroy. |
| `github` | `iac/prod/github` | `repo-packer-images` | ✏️ | Plan: 1 to add, 1 to change, 0 to destroy. |

<details><summary><b>✏️ github (iac/prod/github) / repo-github-actions</b></summary>

```diff
Acquiring state lock. This may take a few moments...
github_repository.default[0]: Refreshing state... [id=github-actions]
github_branch_default.default[0]: Refreshing state... [id=github-actions]
github_repository_ruleset.default["default_branch_protection"]: Refreshing state... [id=14122559]

OpenTofu will perform the following actions:
  # github_repository_file.codeowners[0] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_author                = "github-actions[bot]"
      + commit_email                 = "github-actions[bot]@users.noreply.github.com"
      + commit_message               = "chore: update CODEOWNERS [skip ci]"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            /.github/ @proxmox-home-lab/platform
            * @proxmox-home-lab/platform
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "github-actions"
      + repository_id                = (known after apply)
      + sha                          = (known after apply)
    }
  # github_repository_ruleset.default["default_branch_protection"] will be updated in-place
  ~ resource "github_repository_ruleset" "default" {
        id          = "14122559"
        name        = "default-branch-protection"
        # (6 unchanged attributes hidden)
      - bypass_actors {
          - actor_id    = 0 -> null
          - actor_type  = "OrganizationAdmin" -> null
          - bypass_mode = "always" -> null
        }
      - bypass_actors {
          - actor_id    = 1700699 -> null
          - actor_type  = "Integration" -> null
          - bypass_mode = "always" -> null
        }
        # (2 unchanged blocks hidden)
    }
```

</details>

<details><summary><b>✏️ github (iac/prod/github) / repo-github-org</b></summary>

```diff
Acquiring state lock. This may take a few moments...
github_repository.default[0]: Refreshing state... [id=.github]
github_repository_file.codeowners[0]: Refreshing state... [id=.github:.github/CODEOWNERS:main]
github_repository_ruleset.default["default_branch_protection"]: Refreshing state... [id=14122558]

OpenTofu will perform the following actions:
  # github_repository_ruleset.default["default_branch_protection"] will be updated in-place
  ~ resource "github_repository_ruleset" "default" {
        id          = "14122558"
        name        = "default-branch-protection"
        # (6 unchanged attributes hidden)
      ~ bypass_actors {
          ~ actor_id    = 1700699 -> 78452327
            # (2 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }
```

</details>

<details><summary><b>✏️ github (iac/prod/github) / repo-infrastructure-catalog</b></summary>

```diff
Acquiring state lock. This may take a few moments...
github_repository.default[0]: Refreshing state... [id=infrastructure-catalog]
github_branch_default.default[0]: Refreshing state... [id=infrastructure-catalog]
github_repository_ruleset.default["default_branch_protection"]: Refreshing state... [id=14122561]

OpenTofu will perform the following actions:
  # github_repository_file.codeowners[0] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_author                = "github-actions[bot]"
      + commit_email                 = "github-actions[bot]@users.noreply.github.com"
      + commit_message               = "chore: update CODEOWNERS [skip ci]"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            /.github/ @proxmox-home-lab/platform
            * @proxmox-home-lab/platform
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "infrastructure-catalog"
      + repository_id                = (known after apply)
      + sha                          = (known after apply)
    }
  # github_repository_ruleset.default["default_branch_protection"] will be updated in-place
  ~ resource "github_repository_ruleset" "default" {
        id          = "14122561"
        name        = "default-branch-protection"
        # (6 unchanged attributes hidden)
      - bypass_actors {
          - actor_id    = 0 -> null
          - actor_type  = "OrganizationAdmin" -> null
          - bypass_mode = "always" -> null
        }
      - bypass_actors {
          - actor_id    = 1700699 -> null
          - actor_type  = "Integration" -> null
          - bypass_mode = "always" -> null
        }
        # (2 unchanged blocks hidden)
    }
```

</details>

<details><summary><b>✏️ github (iac/prod/github) / repo-infrastructure-core</b></summary>

```diff
Acquiring state lock. This may take a few moments...
github_repository.default[0]: Refreshing state... [id=infrastructure-core]
github_branch_default.default[0]: Refreshing state... [id=infrastructure-core]
github_repository_ruleset.default["default_branch_protection"]: Refreshing state... [id=14122573]

OpenTofu will perform the following actions:
  # github_repository_file.codeowners[0] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_author                = "github-actions[bot]"
      + commit_email                 = "github-actions[bot]@users.noreply.github.com"
      + commit_message               = "chore: update CODEOWNERS [skip ci]"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            /.github/ @proxmox-home-lab/platform
            * @proxmox-home-lab/platform
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "infrastructure-core"
      + repository_id                = (known after apply)
      + sha                          = (known after apply)
    }
  # github_repository_ruleset.default["default_branch_protection"] will be updated in-place
  ~ resource "github_repository_ruleset" "default" {
        id          = "14122573"
        name        = "default-branch-protection"
        # (6 unchanged attributes hidden)
      - bypass_actors {
          - actor_id    = 0 -> null
          - actor_type  = "OrganizationAdmin" -> null
          - bypass_mode = "always" -> null
        }
      - bypass_actors {
          - actor_id    = 1700699 -> null
          - actor_type  = "Integration" -> null
          - bypass_mode = "always" -> null
        }
        # (2 unchanged blocks hidden)
    }
```

</details>

<details><summary><b>✏️ github (iac/prod/github) / repo-packer-images</b></summary>

```diff
Acquiring state lock. This may take a few moments...
github_repository.default[0]: Refreshing state... [id=packer-images]
github_branch_default.default[0]: Refreshing state... [id=packer-images]
github_repository_ruleset.default["default_branch_protection"]: Refreshing state... [id=14122560]

OpenTofu will perform the following actions:
  # github_repository_file.codeowners[0] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_author                = "github-actions[bot]"
      + commit_email                 = "github-actions[bot]@users.noreply.github.com"
      + commit_message               = "chore: update CODEOWNERS [skip ci]"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            /.github/ @proxmox-home-lab/platform
            * @proxmox-home-lab/platform
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "packer-images"
      + repository_id                = (known after apply)
      + sha                          = (known after apply)
    }
  # github_repository_ruleset.default["default_branch_protection"] will be updated in-place
  ~ resource "github_repository_ruleset" "default" {
        id          = "14122560"
        name        = "default-branch-protection"
        # (6 unchanged attributes hidden)
      - bypass_actors {
          - actor_id    = 0 -> null
          - actor_type  = "OrganizationAdmin" -> null
          - bypass_mode = "always" -> null
        }
      - bypass_actors {
          - actor_id    = 1700699 -> null
          - actor_type  = "Integration" -> null
          - bypass_mode = "always" -> null
        }
        # (2 unchanged blocks hidden)
    }
```

</details>

